app/controllers/home_controller.rb

  def all
    @link = Link.new
    @links = Link.paginate(:page => params[:page], :per_page => 50)
---
SELECT COUNT(*) FROM `links`
SELECT `links`.* FROM `links` LIMIT 4 OFFSET 0